---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.NoSolidInMass
source: html/d8b6d10d-fbb6-c6ac-7b38-6d6c1a00ff38.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.NoSolidInMass Property

Mass contains no solid geometry. Mass Floors, volume, and surface area, won't be computed.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoSolidInMass { get; }
```